erpedt.СХК_Расширение/src/Reports/СХК_ОстаткиПоЯчейкам_v4/СХК_ОстаткиПоЯчейкам_v4.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СХК_ОстаткиПоЯчейкам_v4</name>
</mdclass:Report>

erpedt.СХК_Расширение/src/Documents/РасходныйОрдерНаТовары/РасходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5b57481-c7d7-459c-8f38-003976928dcf">
  <name>РасходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="47e1733e-b075-4282-944c-d07d96cd86a9">
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="96ee5655-e55c-4d9d-9386-a82e47bcd733">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="08a6fc5b-ac14-420f-987d-169c39288bf4">
    <name>ЗаданиеНаПеревозку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1e82bc85-5efe-473f-a2a6-04b053896ef5">
    <name>ЗонаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63f1d0df-8450-40b2-a6bf-26e9a9bc348d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5d8985e0-1a5e-4908-ba86-c4b692cd1634">
    <name>Контролер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="49f3e5fd-cf9c-4585-8222-c47ae930e2dd">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="145a504e-53c5-4349-a710-b106ea052174">
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5fb4b5c4-30c2-4b89-82ff-7057477218df">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="00a21d2c-dfa9-40aa-938f-3fe890533f41">
    <name>ПорядокДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6a9f8399-4614-4cb5-ba80-210c90c11e54">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8ee7ff7a-ec43-4840-800d-22245c14dc90">
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b4c013e1-f51f-4900-840f-f755e500fa76">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89cd1a11-c961-49a0-b7ea-67cc67387e68">
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="07d94e4d-722d-4939-a3da-ba2a3afba256">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СХК_ПринятТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="0d012d0d-0f82-44cb-9d3b-79dd5ae817e2">
    <name>Отгрузил</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="f93cbc89-602b-4c37-a90c-1bceda80afe7">
    <name>ТоварыПоРаспоряжениям</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="07df2cb8-3a48-4671-b17f-d2bf82e412f8">
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="83f29f84-a577-47ce-933a-46184309914f">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СХК_НомерПалета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="83b872e0-168f-4cbc-b791-68c2edf79de4">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cd7cf0b2-0078-4dfa-b137-5418e69d7024">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8e2e117e-50d4-46cf-9e08-ea6f475d1cca">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ae04c7e3-73f4-4a07-bef6-baf69fcb4dfc">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="389dae2c-5f04-4c10-8555-7103bd0c3f21">
    <name>ОтгружаемыеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0185ac19-4e81-475e-842b-4f1cec88f0d3">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="323f8573-378e-4fef-931a-b93c2c113890">
      <name>УпаковочныйЛистРодитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c4e6782d-54b8-4614-8549-b94f2af33d1b">
      <name>Действие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="26cd1a83-599c-4cb2-88f4-8da57cd2dfaf">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="152a5a3e-8c56-4983-9052-b8b75a6e0d12">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8666ee78-482b-4c09-9baa-791917648dbd">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b9cf586a-fbd5-4e5f-a0f7-df3ef40e11d2">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="93ae14aa-f407-4566-96ba-2cbba0eadcc2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fc35a8ee-3531-4b7e-8222-611bb0bc88ab">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="40dd6af6-2e66-4e56-b31e-687455807ff2">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpedt.СХК_Расширение/src/Reports/СХК_ОстаткиПоЯчейкам_v4/ObjectModule.bsl
Процедура ПередЗагрузкойВариантаНаСервере(ЭтаФорма, НовыеНастройкиКД) Экспорт
	Отчет = ЭтаФорма.Отчет;
	КомпоновщикНастроекФормы = Отчет.КомпоновщикНастроек;
	
	УстановитьОбязательныеНастройки(КомпоновщикНастроекФормы, Истина);
	
	НовыеНастройкиКД = КомпоновщикНастроекФормы.Настройки;   
	
КонецПроцедуры 

Процедура УстановитьОбязательныеНастройки(КомпоновщикНастроек, ПользовательскиеНастройкиМодифицированы)
	ПараметрДатаОтчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Период");  
	ПараметрДатаОтчета.Использование = Истина;
	
КонецПроцедуры


#Область ОбработчикиСобытий
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) 
	//ДатаНачала = ТекущаяДата()-180*86400;
	//ДатаОкончания = ТекущаяДата();
	СтандартнаяОбработка = Ложь;
	ПользовательскиеНастройкиМодифицированы = Ложь;
	
	УстановитьОбязательныеНастройки(КомпоновщикНастроек, ПользовательскиеНастройкиМодифицированы);
	
	//
	//// Подготовим и выведем отчет.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	//
	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	//	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных, ДанныеРасшифровки);
	//	
	//КомпоновкаДанныхСервер.УстановитьЗаголовкиМакетаКомпоновки(СтруктураЗаголовковПолей(), МакетКомпоновки);
	//
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//
	ТабОстатки = Платежи();
		//
	ВнешниеНаборыДанных = Новый Структура("ТабОстатки", ТабОстатки);
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	//ПроцессорВывода.НачатьВывод();
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	
	//ПроцессорВывода.ЗакончитьВывод();
	

КонецПроцедуры    
#КонецОбласти 


Функция Платежи()  
	
	ДатаОтчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Период").Значение.Дата;;	
	//ДатаНачала = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Период").Значение.ДатаНачала;	
	
	Таб = Новый ТаблицаЗначений; 
	Таб.Колонки.Добавить("Номенклатура");
	Таб.Колонки.Добавить("Серия");
	Таб.Колонки.Добавить("Ячейка");
	Таб.Колонки.Добавить("ВНаличииОстатокГП");
	//Таб.Колонки.Добавить("ВНаличииОстатокЯчейка");  
	Таб.Колонки.Добавить("ВНаличииОстаток");  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	               |	ВложенныйЗапрос.Серия КАК Серия,
	               |	СУММА(ВложенныйЗапрос.ВНаличииОстатокГП) КАК ВНаличииОстатокГП,
	               |	СХК_ТоварыНаСкладеОстатки.Ячейка КАК Ячейка,
	               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК ВНаличииОстаток
	               |ПОМЕСТИТЬ ВТЗ
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		СХК_ТоварыНаСкладеОстатки.Номенклатура КАК Номенклатура,
	               |		СХК_ТоварыНаСкладеОстатки.Серия КАК Серия,
	               |		0 КАК ВНаличииОстатокГП,
	               |		СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК ВНаличииОстатокЯчейка
	               |	ИЗ
	               |		РегистрНакопления.СХК_ТоварыНаСкладе.Остатки(&ДатаОтчета, ) КАК СХК_ТоварыНаСкладеОстатки
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |		ТоварыНаСкладахОстатки.Номенклатура,
	               |		ТоварыНаСкладахОстатки.Серия.Наименование,
	               |		ТоварыНаСкладахОстатки.ВНаличииОстаток,
	               |		0
	               |	ИЗ
	               |		РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаОтчета, Склад = &СкладГП) КАК ТоварыНаСкладахОстатки) КАК ВложенныйЗапрос
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки
	               |		ПО ВложенныйЗапрос.Серия = СХК_ТоварыНаСкладеОстатки.Серия
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.Серия,
	               |	СХК_ТоварыНаСкладеОстатки.Ячейка,
	               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ТоварыКОтгрузке.КОтгрузке) КАК Отгружается,
	               |	ТоварыКОтгрузке.Серия КАК Серия,
	               |	ТоварыКОтгрузке.Номенклатура КАК Номенклатура,
	               |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК РО
	               |ПОМЕСТИТЬ ВТЗКОтгрузке
	               |ИЗ
	               |	РегистрНакопления.ТоварыКОтгрузке КАК ТоварыКОтгрузке
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	               |		ПО (РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = ТоварыКОтгрузке.ДокументОтгрузки)
	               |			И (РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Серия = ТоварыКОтгрузке.Серия)
	               |ГДЕ
	               |	ТоварыКОтгрузке.ДокументОтгрузки.Дата >= &Дата
	               |	И НЕ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Отгружен))
	               |	И ТоварыКОтгрузке.Склад = &СкладГП
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыКОтгрузке.Серия,
	               |	ТоварыКОтгрузке.Номенклатура,
	               |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТЗ.Серия КАК Серия,
	               |	СУММА(СХК_СписаниеЯчейки.Количество) КАК Отгружается
	               |ПОМЕСТИТЬ ВТЗКОтгрузкеИтог
	               |ИЗ
	               |	ВТЗКОтгрузке КАК ВТЗ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СХК_СписаниеЯчейки.СобранныеТовары КАК СХК_СписаниеЯчейки
	               |		ПО ВТЗ.РО = СХК_СписаниеЯчейки.Ссылка.ДокОснования
	               |			И ВТЗ.Серия = СХК_СписаниеЯчейки.Серия
	               |ГДЕ
	               //|	СХК_СписаниеЯчейки.Ссылка.Собран = ЛОЖЬ
	               |	СХК_СписаниеЯчейки.Ссылка.Проведен = Истина
	               |	И СХК_СписаниеЯчейки.Ссылка.Дата >= &Дата
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТЗ.Серия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТЗ.Номенклатура КАК Номенклатура,
	               |	ВТЗ.Серия КАК Серия,
	               |	ВТЗ.ВНаличииОстатокГП КАК ВНаличииОстатокГП,
	               |	ВТЗ.Ячейка КАК Ячейка,
	               |	ВТЗ.ВНаличииОстаток КАК ВНаличииОстаток,
	               |	ТоварыКОтгрузкеОстатки.Отгружается КАК Отгружается
	               |ИЗ
	               |	ВТЗ КАК ВТЗ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗКОтгрузкеИтог КАК ТоварыКОтгрузкеОстатки
	               |		ПО ВТЗ.Серия = ТоварыКОтгрузкеОстатки.Серия.Наименование
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТЗ.Номенклатура,
	               |	ВТЗ.Серия,
	               |	ВТЗ.ВНаличииОстатокГП,
	               |	ВТЗ.Ячейка,
	               |	ВТЗ.ВНаличииОстаток,
	               |	ТоварыКОтгрузкеОстатки.Отгружается";
	              // |ГДЕ
	              // |	СХК_ТоварыНаСкладеОстатки.Ячейка = &Ячейка";
	Запрос.УстановитьПараметр("ДатаОтчета",КонецДня(ДатаОтчета)); 
	Запрос.УстановитьПараметр("Дата",Дата("01.01.2026 00:00:00")); 
	Запрос.УстановитьПараметр("СкладГП",Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции")); 

	Таб =  Запрос.Выполнить().Выгрузить();  
	Таб.Свернуть("Номенклатура,Серия,Ячейка,ВНаличииОстатокГП,Отгружается","ВНаличииОстаток");	
	Возврат Таб;
	
 КонецФункции
